---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.op_LessThan(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
source: html/525682f3-ae1d-572b-433e-9acdc8c2f9a5.htm
---
# Autodesk.Revit.DB.WorksetId.op_LessThan Method

Determines whether this WorksetId is less than another WorksetId.

## Syntax (C#)
```csharp
public static bool operator <(
	WorksetId WorksetId1,
	WorksetId WorksetId2
)
```

## Parameters
- **WorksetId1** (`Autodesk.Revit.DB.WorksetId`) - The first WorksetId.
- **WorksetId2** (`Autodesk.Revit.DB.WorksetId`) - The second WorksetId.

## Returns
True if the first WorksetId is less than the second WorksetId, otherwise, false.